#!/bin/bash

CASE1='1
5 5
.....
.#A#.
...B.
.#.#.
.....
'

CASE2='2
5 5
.....
.#A#.
...B.
.#.#.
.....
7 9
.........
.#.#.#.#.
..AB.....
.#.#.#.#.
.........
.#.#.#.#.
.........
'

CASE3='1
3 3
B..
.#.
..A
'

CASE4='1
7 9
.........
.#.#.#.#.
..AB.....
.#.#.#.#.
.........
.#.#.#.#.
.........
'

CASE5='1
5 5
.....
.#.#.
.....
B#.#.
.A...
'

# Используем eval для получения значения переменной
case_var="CASE$1"
eval input=\$$case_var

# Передаём переменную как ввод в программу Go
echo "$input" | go run main.go